<?php

return [
    'id' => 'ID',
    'name' => 'Название',
    'access_config' => 'Доступы',
    'storage_settings' => 'Настройки',
    'storage_type' => 'Тип хранилища',

    'data_set' => 'Данные установлены',
    'data_not_set' => 'Данные не установлены',

    'config' => [
        'generateFileName' => 'Генерировать имя файла',
        'overwrite' => 'Перезаписывать файлы с одинаковыми именами',
        'lengthOfGeneratedName' => 'Длина генерированного имени',
        'folder' => 'Директория для загрузки',
        'subFolderBasedOnType' => 'Загружать в подпапку с именем типа файла',

        'choice_storage' => 'Выберите хранилище.',
        'wrong_storage' => 'Хранилище не найдено, либо нет доступа',
    ],

    'bot' => [
        'enter_name' => 'Введите название для хранилища',
        'choice_type' => 'Выберите тип хранилища',
        'invalid_name' => 'Имя не может содержать специальные только символы или быть пустым (минимум 3 символа)',
        'enter_storage_type' => 'Введите тип облачного хранилища',
        'storage_type_not_found' => 'Тип хранилища не найден',
        'access_data_needed' => 'Необходимо ввести данные для доступов к хранимлищу',
        'end_add_conversation' => 'Токен установлен. Теперь Вы можете попробовать загрузить ваш первый файл.',

        'choice_storage' => 'Выберите хранилище.',
        'wrong_storage' => 'Хранилище не найдено, либо нет доступа',
    ],
];